Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: The Perfection of Wisdom in Twenty-Five Thousand Lines Chapter 1: The Context {Dt.4}

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་རི་བྱ་རྒོད་འཕུངས་པོ་ལ། དགེ་སློང་ལྔ་སྟོང་ཙམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་གཅིག་སྟེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དུ་གྱུར་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: The Blessed One was staying on Vulture Peak near Rājagṛha, with a large monastic gathering comprising some five thousand monks.

source: ཁུར་བོར་བ། རང་གི་དོན་རབ་ཏུ་ཐོབ་པ། སྲིད་པར་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ། བཀའ་ཡང་དག་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཀྱི་དབང་ཐམས་ཅད་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཆོག་ཐོབ་པ་ཤ་སྟག་སྟེ། གང་ཟག་གཅིག་མ་གཏོགས་པ་ནི། འདི་ལྟར་སློབ་པ་རྒྱུན་ཏུ་ཞུགས་པ་ཚེ་དང་ལྡན་པ་དགའ་བོའོ།
en: All of them were arhats who had attained the cessation of contaminants, free of afflicted mental states, fully controlled, their minds thoroughly liberated, their wisdom well liberated, thoroughbreds, mighty elephants, their tasks accomplished, their work completed, their burdens relinquished, their own objectives fulfilled, the fetters binding them to the rebirth process completely severed, their minds thoroughly liberated through perfect instruction, supreme in their perfection of all mental powers, with the exception of just one person— the venerable Ānanda, still a trainee who had entered the stream.

source: །དགེ་སློང་མ་གྲགས་འཛིན་དང་། སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་ལ་སོགས་པ་ལྔ་བརྒྱ་ཙམ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་ཤིན་ཏུ་མང་བ་ཀུན་ཀྱང་ཆོས་མཐོང་བ་ཤ་སྟག་དང་།
en: Also present were some five hundred nuns headed by Yaśodharā and Mahāprajāpatī, and a great many laymen and laywomen, all of whom had seen the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་གྲངས་མེད་པ་ཐམས་ཅད་ཀྱང་གཟུངས་རབ་ཏུ་ཐོབ་པ། ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ། སྟོང་པ་ཉིད་ཀྱིས་རྣམ་པར་སྤྱོད་པ། མཚན་མ་མེད་པའི་སྤྱོད་ཡུལ་ཅན། རྟོག་པ་མེད་པའི་སྨོན་ལམ་དང་ལྡན་པ། ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་རབ་ཏུ་ཐོབ་པ། ཆགས་པ་མེད་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པ།
en: There, too, were innumerable, inestimable bodhisattva great beings, all of whom had attained the dhāraṇīs and attained the meditative stabilities, acting in accord with emptiness, their perceptual range being one of signlessness, their aspirations free from deliberation, their attainments the acceptance of the sameness of all phenomena and the dhāraṇī of nonattachment.

source: ཐོགས་པ་མེད་པའི་སྤོབས་པ་དང་ལྡན་པ། བསྟན་པ་ཟད་མི་ཤེས་པ་ལ་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚུལ་ཁོང་དུ་ཆུད་པ། མངོན་པར་ཤེས་པ་ཆེན་པོས་རྣམ་པར་རྩེ་བ། མངོན་པར་ཤེས་པ་ཤིན་ཏུ་མ་ཉམས་པ། མཉན་པར་འོས་པའི་ཚིག་དང་ལྡན་པ།
en: They possessed inspired eloquence that was unimpeded and had comprehended the inexhaustible teachings according to their exact knowledge.

source: ལེ་ལོ་མེད་ཅིང་བརྩོན་འགྲུས་བརྩམས་པ། ལུས་དང་སྲོག་ལ་མི་ལྟ་བ། ཚུལ་འཆོས་པ་མེད་པ། ཁ་གསག་མེད་པ། གྲགས་པ་དང་།
en: Using miraculous displays through their great extrasensory powers, their extrasensory powers never failing, and with engaging speech, without indolence but with perseverance, without regard for their bodies or their lives, their conduct unpretentious, without insincerity, and without thoughts of ulterior fame, profit, or respect, free from self-interest they taught the Dharma.

source: ཁེ་དང་། བཀུར་སྟིའི་སེམས་མེད་པ། ཟང་ཟིང་མེད་པའི་ཆོས་སྟོན་པ། ཆོས་ཟབ་མོའི་བཟོད་པ་དམ་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ།
en: They had realized and integrated the sublime acceptance of the profound dharmas.

source: མི་འཇིགས་པ་ཆེན་པོ་ཐོབ་པ། ཡིད་ཡོངས་སུ་ཞུམ་པ་མེད་པ། བདུད་ཀྱི་ལས་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ།
en: They had acquired great fearlessness, without discouragement, and they had gone completely beyond all the works of Māra.

source: ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་ཆད་པ། ལས་དང་ཉོན་མོངས་པ་དང་། ཕྱིར་རྒོལ་བ་རབ་ཏུ་བཅོམ་པ། ཕ་རོལ་པོའི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པ།
en: Having interrupted the continuity of karmic obscurations, they had overcome karma, the afflicted mental states, and hostile forces, and in the face of all challenges had remained undefeated.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་རྟོགས་པར་དཀའ་བ།
en: They were difficult for all śrāvakas and pratyekabuddhas to fathom.

source: ཆོས་རབ་ཏུ་རྟོགས་པས་རྣམ་པར་དབྱེ་ཞིང་བསྟན་པ་ལ་མཁས་པ་བསྐལ་པ་གྲངས་མེད་པ་ནས་སྨོན་ལམ་ཤིན་ཏུ་བརྩམས་པ།
en: Through their realization they were skilled in analyzing and teaching the Dharma, and they had energetically applied themselves to their aspirations over countless eons.

source: བཞིན་འཛུམ་པ་དང་ལྡན་པ། སྔོན་དུ་སྨྲ་བ། ཁྲོ་གཉེར་མེད་པ། སྙན་ཅིང་འཇམ་པའི་ཚིག་དང་ལྡན་པ། ཕ་རོལ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་སུ་བརྗོད་པ་ལ་མཁས་པ།
en: Smiling and communicative, their faces without frowns of anger, with their sweet, gentle words they were skilled in addressing others in melodic verse.

source: སྤོབས་པ་མི་ཆོད་པ། འཁོར་མཐའ་ཡས་པ་ཟིལ་གྱིས་གནོན་པའི་མི་འཇིགས་པ་དང་ལྡན་པ།
en: As their inspired eloquence flowed uninterrupted, they possessed the fearlessness that overwhelmed endless assemblies.

source: བསྐལ་པ་བྱེ་བ་མཐའ་ཡས་པར་བསྟན་པའི་ཡེ་ཤེས་ཀྱིས་འབྱུང་བ་ལ་མཁས་པ།
en: From the wisdom that they had taught for endless tens of millions of eons, they were skilled in emancipation.

source: ཆོས་ཐམས་ཅད་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་དང་། རྨི་ལམ་དང་། སྒྲ་བརྙན་དང་། མིག་ཡོར་དང་། ནམ་མཁའ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་དང་། སྤྲུལ་པ་དང་། གཟུགས་བརྙན་ལྟ་བུར་ཁོང་དུ་ཆུད་པ།
en: They had comprehended that all phenomena are like a magical display, a mirage, a reflection of the moon in water, a dream, an echo, an optical aberration, empty space, a castle in the sky, a phantom, or a reflection. {

source: སེམས་ཡོངས་སུ་ཞུམ་བ་མེད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་དང་། ཤེས་པ་ཕྲ་བ་དང་། སྤྱོད་པ་དང་། མོས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་མཁས་པ།
en: Dt.5} Without discouragement, they were skilled in comprehending the mental attitudes, subtle knowledge, conduct, and interests of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྡང་བ་མེད་པའི་སེམས་དང་ལྡན་པ། བཟོད་པ་རླབས་པོ་ཆེ་དང་ལྡན་པ།
en: Their attitude toward all beings was free of any animosity, and their tolerance was immense.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་རྟོགས་པར་བྱ་བའི་ཡེ་ཤེས་ལ་མཁས་པ། ཆོས་ཉིད་ཟབ་མོ་དང་ལྡན་པས་གཏིང་དཔག་དཀའ་བ།
en: They were skilled in the wisdom that brings the sameness of all phenomena to be understood, and because they were possessed of profound reality their depth was hard to estimate.

source: རང་གི་སེམས་ལ་དབང་རབ་ཏུ་ཐོབ་པ། ཆོས་ཐམས་ཅད་ལ་དབང་ཤིན་ཏུ་ཐོབ་པ།
en: They had fully attained power over their own minds, and they had entirely attained power over all phenomena.

source: ལས་དང་ཉོན་མོངས་པ་དང་ལྟ་བའི་སྒྲིབ་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བ།
en: They were liberated from all past actions, afflicted mental states, and obscurations of view.

source: བརྟེན་པ་རྟོགས་པར་བསྟན་པ་ལ་མཁས་པ། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཚུལ་ཟད་མི་ཤེས་པ་ལ་ཞུགས་པ། ལྟ་བ་དང་། བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་དང་བྲལ་བ། ཀུན་ཏུ་སྦྱོར་བ་ཐམས་ཅད་སྤངས་པ། ལས་དང་།
en: They were skilled in teaching how to understand dependence, and had engaged in all the inexhaustible modes of dependent origination, were free from all views, latent impulses, and obsessions, and had abandoned all fetters.

source: ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་མཁས་པ། བདེན་པ་རབ་ཏུ་རྟོགས་པར་བྱ་བའི་ཡེ་ཤེས་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་སྒྲ་བརྙན་དང་འདྲ་བར་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་མོས་པ། ཆོས་ཀྱི་ཚུལ་བསྟན་པ་ཚད་མེད་པ་ལ་འཇིགས་པ་མེད་པ། བདག་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་མཁས་པ།
en: They were skilled in bringing about peace from all actions and afflicted mental states, skilled in the primordial wisdom that brings realization of the truth, constantly and uninterruptedly considering all phenomena to resemble an echo, fearless in their measureless teachings of the ways of the Dharma, and skilled in bringing forth comprehension of the true nature itself.

source: སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པ་རྣམ་པར་དགོད་པའི་སྨོན་ལམ་གྱིས་འགྲོ་བ་ཡོངས་སུ་ཟིན་པ།
en: Their progress was governed by their aspiration to establish infinite buddhafields.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་ན་བཞུགས་པའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་མངོན་དུ་གྱུར་པ། སངས་རྒྱས་འབྱུང་བ་ཐམས་ཅད་དུ་ཉེ་བར་འགྲོ་བ་ལ་མཁས་པ། སངས་རྒྱས་དཔག་ཏུ་མེད་པ་ལ་གསོལ་བ་གདབ་པར་མཁས་པ།
en: Constantly and uninterruptedly they brought into being the meditative stability of recollecting the buddhas who reside in countless world systems; they were skilled in attending buddhas wherever they appear and skilled in requesting innumerable buddhas to teach.

source: སེམས་ཅན་གྱི་ལྟ་བ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐྱེད་པའི་ཉོན་མོངས་པ་ཞི་བར་བྱ་བ་ལ་མཁས་པ། ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་མངོན་པར་བསྒྲུབ་པ་ལ་རྣམ་པར་རྩེ་བའི་ཡེ་ཤེས་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ། ཡོན་ཏན་བརྗོད་པ་བསྐལ་པ་མཐའ་ཡས་པར་མི་ཟད་པ་དང་ལྡན་པ་ཤ་སྟག་དང་ཐབས་གཅིག་སྟེ། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟང་སྐྱོང་དང་། རིན་ཆེན་འབྱུང་གནས་དང་། རིན་ཆེན་སྙིང་པོ་དང་། རིན་ཆེན་བྱིན་པ་དང་། དེད་དཔོན་དམ་པ་དང་། སྐྱེས་བུས་བྱིན་དང་། སྐྱོབ་སྦེད་དང་། ཆུ་བདག་ལྷ་དང་། དབང་པོས་བྱིན་དང་། བཟང་པོའི་སྟོབས་དང་། བློ་གྲོས་དམ་པ་དང་། འཕགས་པའི་བློ་གྲོས་དང་། བློ་གྲོས་འཕེལ་བ་དང་། བློ་གྲོས་མཐའ་ཡས་དང་། དོན་ཡོད་མཐོང་བ་དང་། སྒྲིབ་མེད་བློ་གྲོས་དང་། རབ་ཏུ་ཞུགས་པ་དང་། མཐུ་དམ་པས་རྣམ་པར་གནོན་པ་དང་། བརྩོན་འགྲུས་མཐའ་ཡས་དང་། རྟག་ཏུ་བརྩོན་པ་དང་། རྟག་ཏུ་སྦྱོར་བ་དང་། མི་གཏོང་བརྩོན་པ་དང་། ཉི་མའི་སྙིང་པོ་དང་། ཟླ་བའི་སྙིང་པོ་དང་།
en: They were skilled in bringing about peace from the afflicted mental states that are generated through the diverse false views of beings, and skilled in bringing forth realization of the wisdom that revels in the miraculous production of a hundred thousand meditative stabilities.

source: བློ་གྲོས་དཔེ་མེད་པ་དང་། སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་དང་། མཐུ་ཆེན་པོ་ཐོབ་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བདུད་ཀྱི་སྟོབས་རབ་ཏུ་འཇོམས་པ་དང་། རྡོ་རྗེ་བློ་གྲོས་དང་། ལག་ན་རིན་ཆེན་ཕྱག་རྒྱ་དང་། རྟག་ཏུ་ལག་བརྐྱང་དང་། སྙིང་རྗེ་ཆེར་སེམས་དང་།
en: Every one of them had qualities of which a full description would be incomplete even if infinite eons were spent on it.

source: རྒྱན་ཆེན་པོ་དང་། རྣམ་པར་བཀོད་པའི་རྒྱལ་པོ་དང་། རི་བོའི་ཟོམ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། དེ་དག་ལ་སོགས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དག་དང་ཐབས་གཅིག་ཏུ་བཞུགས་སོ།
en: Among them were the following: the bodhisattva great being Bhadrapāla, along with Ratnākara, Ratnagarbha, Ratnadatta, Sārthavāha, Naradatta, Guhagupta, Varuṇadeva, Indradatta, Bhadrabala, Uttaramati, Viśeṣamati, Vardhamānamati, Anantamati, Amoghadarśin, Anāvaraṇamati, Susaṃprasthita, Suvikrānta­vikrāmin, Anantavīrya, Nityodyukta, Nityayukta, Anikṣiptadhura, Sūryagarbha, Candragarbha, Anupamamati, Avalokiteśvara, Mahā­sthāma­prāpta, Mañjuśrī­kumāra­bhūta, Māra­bala­pramardin, Vajramati, Ratna­mudrā­hasta, Nityotkṣipta­hasta, Mahā­karuṇā­cintin, Mahāvyūha, Vyūharāja, Merukūṭa, and the bodhisattva great being Maitreya, heading many hundred billion trillions of accompanying bodhisattvas.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་གདན་སེང་གེའི་ཁྲི་བཤམས་ནས་སྐུ་དྲང་པོར་བསྲང་སྟེ། དགོངས་པ་མངོན་དུ་བཞག་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་སོ།
en: At that time, the Blessed One himself arranged his seat, the lion throne, and sat upright with his legs crossed, directing his attention.

source: །དེར་བཞུགས་ནས་ཏིང་ངེ་འཛིན་གང་དུ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་འདུ་བ་དང་། ཁོངས་སུ་ཆུད་པ་དང་། རྗེས་སུ་འབྲང་བ་དང་། འདུ་བར་འགྱུར་བའི་ཏིང་ངེ་འཛིན་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ལ་མཉམ་པར་བཞག་གོ །
en: Seated there, he was absorbed in the meditative stability called king of meditative stabilities, in which all meditative stabilities are gathered, comprehended, pursued, and subsumed.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དགོངས་ཤིང་ཡང་དག་པར་མཁྱེན་པས་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་ཏེ། འཕྲུལ་གྱི་སྤྱན་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལ་རྣམ་པར་གཟིགས་སོ།
en: The Blessed One, mindful and with full awareness, then arose from that meditative stability and observed this buddhafield with clairvoyance. {

source: །དེ་ལྟར་གཟིགས་ནས་སྐུ་ཐམས་ཅད་ནས་འོད་རབ་ཏུ་བཀྱེ་སྟེ།
en: Dt.6} Seeing in this manner, he sent forth lights from his entire body.

source: དེའི་ཞབས་ཀྱི་མཐིལ་གཉིས་ཀྱི་འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པ་གཉིས་ལས་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དྲུག་ཅུ་དྲུག་ཅུ་བྱུང་ངོ་།
en: Sixty hundred billion trillion rays of light issued from each of the two wheels with a thousand spokes that were imprinted on the soles of his feet.

source: །ཞབས་གཉིས་ཀྱི་སོར་མོ་བཅུ་ལས་ཀྱང་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དྲུག་ཅུ་དྲུག་ཅུ་བྱུང་ངོ་། །ཞབས་ཀྱི་ལོང་བུ་གཉིས་དང་། ཞབས་བྱིན་པ་གཉིས་དང་། ཞབས་པུས་མོ་གཉིས་དང་།
en: Sixty hundred billion trillion rays of light also issued from the ten toes of his two feet.

source: ཞབས་བརླ་གཉིས་དང་། སྐུ་སྟ་ཟུར་གཉིས་དང་། སྐུ་ལྟེ་བའི་དཀྱིལ་འཁོར་དང་། སྐུ་རྩིབ་ལོགས་གཉིས་དང་། ཐུགས་ཀའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་དཔལ་གྱི་བེའུ་ལས་ཀྱང་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དྲུག་ཅུ་དྲུག་ཅུ་བྱུང་ངོ་།
en: Sixty hundred billion trillion rays of light also issued respectively from his two ankles, his two shins, his two knees, his two thighs, his two hips, his navel, the two sides of his ribs, and from the śrīvatsa at his heart, which is one of the major marks of a great person.

source: །ཕྱག་གི་སོར་མོ་བཅུ་ལས་ཀྱང་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དྲུག་ཅུ་དྲུག་ཅུ་བྱུང་ངོ་། །དེ་བཞིན་དུ་ཕྱག་ལག་ངར་གཉིས་དང་། སྐུ་ཕྲག་པ་གཉིས་དང་། མགུར་དང་། ཚེམས་མཆེ་བ་བཞི་དང་། ཚེམས་བཞི་བཅུ་དང་། སྤྱན་གཉིས་དང་། སྙན་གཉིས་དང་། ཤངས་ཀྱི་སྦུབས་གཉིས་དང་།
en: Sixty hundred billion trillion rays of light also issued respectively from each of his ten fingers, and similarly, sixty hundred billion trillion rays of light also issued respectively from his two arms, his two shoulders, his neck, his four incisors, his forty teeth, his two eyes, his two ears, his two nostrils, the hair ringlet between his eyebrows, his uṣṇīṣa, and his mouth.

source: སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་དང་། སྟེང་གི་སྤྱི་གཙུག་དང་། ཞལ་གྱི་སྒོ་ནས་ཀྱང་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དྲུག་ཅུ་དྲུག་ཅུ་བྱུང་སྟེ། འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དྲུག་ཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དག་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་ཏེ།
en: All those sets of sixty hundred billion trillion rays of light permeated this great trichiliocosm with a great brightness.

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ།
en: The world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, were permeated with a great brightness.

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་འོག་དང་སྟེང་གི་ཕྱོགས་སུ་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ།
en: The world systems of each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, were also permeated with a great brightness.

source: །སེམས་ཅན་གང་གིས་འོད་ཟེར་དེ་མཐོང་བ་དང་། འོད་དེས་གང་ལ་རེག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ།
en: All beings who beheld these rays of light and who were touched by that light became assured of reaching unsurpassed, complete enlightenment. {

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་འོད་ཟེར་རབ་ཏུ་དགྱེ་བ་མཛད་དེ། འོད་དེས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ།
en: Dt.7} Then again, the Blessed One caused light rays to be diffused from all his pores, and that light again permeated these world systems of the great trichiliocosm with a great brightness.

source: །ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ།
en: The world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, were permeated with a great brightness.

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་འོག་དང་སྟེང་གི་ཕྱོགས་སུ་ཕྱོགས་རེ་རེ་ཞིང་ཡང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ།
en: The world systems of each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, were also permeated with a great brightness.

source: །སེམས་ཅན་གང་གིས་འོད་དེ་མཐོང་བ་དང་འོད་དེས་གང་ལ་རེག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ།
en: All beings who beheld that light and who were touched by that light became assured of reaching unsurpassed, complete enlightenment.

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་རང་བཞིན་གྱི་འོད་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་མཛད་དེ།
en: Then again, with the natural light of the tathāgatas the Blessed One caused these world systems of the great trichiliocosm to be permeated with a great brightness.

source: ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་མཛད་དོ།
en: The world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, were permeated with a great brightness.

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་འོག་དང་སྟེང་གི་ཕྱོགས་སུ་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་མཛད་དོ།
en: The world systems of each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, were also permeated with a great brightness.

source: །སེམས་ཅན་གང་གིས་འོད་དེ་མཐོང་བ་དང་། འོད་དེས་གང་ལ་རེག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ།
en: All beings who beheld that light and who were touched by that light became assured of reaching unsurpassed, complete enlightenment.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཞལ་གྱི་སྒོ་ནས་ལྗགས་ཀྱི་དབང་པོ་བཀྲམ་སྟེ།
en: Then the Blessed One extended his tongue from his mouth.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་ལྗགས་ཀྱི་དབང་པོས་ཁྱབ་པར་མཛད་ནས་ཞལ་འཛུམ་པ་མཛད་དོ། །ལྗགས་ཀྱི་དབང་པོ་དེ་ལས་ཀྱང་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་འཐོན་ཏེ། འོད་ཟེར་དེ་དག་ཐམས་ཅད་ལ་པད་མོ་མང་པོ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱུ་ལས་བྱུང་བ།
en: Covering this entire great trichiliocosm with his tongue, he smiled, and from his tongue emanated many hundred billion trillion variegated rays of light.

source: གསེར་གྱི་མདོག་ཏུ་སྣང་བ། འདབ་མ་སྟོང་དང་ལྡན་པ། སྣ་ཚོགས་སུ་འདུག་པ། བལྟ་ན་སྡུག་པ། ཡིད་དུ་འོང་བ། ཁ་དོག་བཟང་བ། དྲི་ཞིམ་པ།
en: On all those rays of light, in their entirety, manifold lotus flowers appeared, fashioned of diverse gemstones, of golden color, with a thousand petals, diverse, beautiful to behold, pleasant, exquisitely shaded, scented, soft, and blissful to the touch like kācalindika.

source: འཇམ་པ། ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་བར་འགྱུར་བ་ཤ་སྟག་ཀུན་ནས་གནས་པར་གྱུར་ཏེ། པད་མོ་དེ་དག་ལ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མང་པོ་བཞུགས་ཤིང་། འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་ཆོས་བསྟན་པ་འདི་ཉིད་ཀྱི་ཆོས་སྟོན་པ་མཛད་དེ།
en: On those lotus flowers were seated many forms of tathāgatas, and the Dharma teaching they taught was this very Dharma teaching concerning the six perfections.

source: དེ་དག་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གཤེགས་ཤིང་དེ་དག་ཏུ་བྱོན་ནས་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་ཆོས་བསྟན་པ་འདི་ཉིད་ཀྱི་ཆོས་སྟོན་ཏོ།
en: They departed for the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and on arriving there, they taught this very Dharma teaching concerning the six perfections. {

source: །དེ་དག་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་འོག་དང་སྟེང་གི་ཕྱོགས་སུ་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གཤེགས་ཤིང་། དེ་དག་ཏུ་བྱོན་ནས་ཀྱང་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་ཆོས་བསྟན་པ་འདི་ཉིད་ཀྱི་ཆོས་སྟོན་ཏོ།
en: Dt.8} They departed for the world systems of each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, and on arriving there, they also taught this very Dharma teaching concerning the six perfections.

source: །སེམས་ཅན་གང་གིས་ཆོས་དེ་དག་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ།
en: All beings who heard those teachings became assured of reaching unsurpassed, complete enlightenment.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གདན་སེང་གེའི་ཁྲི་དེ་ལ་བཞུགས་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་སེང་གེ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་ལ་མཉམ་པར་བཞག་སྟེ། རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་དོ།
en: Then, while seated on the lion throne, the Blessed One became absorbed in the meditative stability of the buddhas called the lion’s play, and manifested his miraculous abilities.

source: །རྫུ་འཕྲུལ་དེ་མངོན་པར་འདུ་མཛད་པས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། གཡོས་སོ། །རབ་ཏུ་གཡོས་སོ། །ཀུན་ཏུ་གཡོས་སོ། །འགུལ་ཏོ། །རབ་ཏུ་འགུལ་ཏོ།
en: By manifesting those miraculous abilities, he caused these world systems of the great trichiliocosm to shake in six ways.

source: །ཀུན་ཏུ་འགུལ་ཏོ། །ལྡེག་གོ །རབ་ཏུ་ལྡེག་གོ །ཀུན་ཏུ་ལྡེག་གོ །ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་དུ་ཆེམ་ཆེམ་མོ། །འུར་འུར། རབ་ཏུ་འུར་འུར། ཀུན་དུ་འུར་འུར་རོ། །ཤིག་ཤིག །རབ་ཏུ་ཤིག་ཤིག །ཀུན་དུ་ཤིག་ཤིག་གོ །
en: That is to say, they shook, shuddered, and juddered; they rocked, reeled, and tottered; they quivered, careened, and convulsed; they trembled, throbbed, and quaked; they rumbled, roared, and thundered; and they faltered, lurched, and staggered.

source: ཤར་མཐོ་ན་ནི་ནུབ་དམའ། ནུབ་མཐོ་ན་ནི་ཤར་དམའ། བྱང་མཐོ་ན་ནི་ལྷོ་དམའ། ལྷོ་མཐོ་ན་ནི་བྱང་དམའ། མཐའ་མཐོ་ན་ནི་དབུས་དམའ།
en: As their eastern sides reared up their western sides plunged down; as their western sides reared up their eastern sides plunged down; as their southern sides reared up their northern sides plunged down; as their northern sides reared up their southern sides plunged down; as their edges reared up their centers plunged down; and as their centers reared up their edges plunged down.

source: དབུས་མཐོ་ན་ནི་མཐའ་དམའ་སྟེ། དལ་བུས་བགས་ཀྱིས་ཉམས་སུ་བདེ་བར་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བ་སྐྱེད་པར་གྱུར་ཏོ། །དེ་ནས་དེའི་ཚེ་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ལ།
en: Then, slowly and gradually, they all settled, whereupon all beings experienced spiritual and temporal well-being.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། མི་ཁོམ་པ་དང་། ངན་སོང་དང་། ངན་འགྲོ་དང་། ལོག་པར་ལྟུང་བ་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་རྒྱུན་ཆད་ཅིང་སྟོངས་པར་གྱུར་ཏེ།
en: At that time, in a single fleeting instant, in this great trichiliocosm, the hells, the animal realms, the worlds of Yama, the states that lack freedom, the lower realms, the evil destinies, and as many places of unfortunate rebirth as there are, were all interrupted and emptied of the beings born in them.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་། མི་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་པར་གྱུར་ཏོ། །དེ་བཞིན་དུ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་དང་།
en: All of those beings were then reborn equal in fortune to human beings, or similarly they were reborn equal in fortune to the gods of the Caturmahā­rāja­kāyika, Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms. {

source: སྐལ་བ་མཉམ་པར་སྐྱེས་པར་གྱུར་ཏོ། །དེ་ནས་ལྷ་དེ་དག་དང་། མི་དེ་དག་དགའ་བ་དང་། མོས་པ་དང་། ཉམས་བདེ་བ་དེ་ཉིད་ཀྱིས་སྔོན་གྱི་ཚེ་རབས་རྗེས་སུ་དྲན་པར་གྱུར་ཏེ།
en: Dt.9} Then those gods and those human beings, with joy, appreciation, and ease, recollected their former lives.
